### Pandas

In [4]:
import pandas as pd
import numpy as np

In [2]:
labels = ['p','q','r','s']

In [3]:
list = [11,21,5,7]

In [12]:
array = np.array([1,2,3,4])

In [13]:
dict = {'p':10,'q':20,'r':30,'s':40}

In [14]:
pd.Series(data=labels)

0    p
1    q
2    r
3    s
dtype: object

In [15]:
pd.Series(data=list,index=labels)

p    11
q    21
r     5
s     7
dtype: int64

In [16]:
pd.Series(labels,list)

11    p
21    q
5     r
7     s
dtype: object

In [17]:
pd.Series(dict)

p    10
q    20
r    30
s    40
dtype: int64

### Pandas dataframe and indexing

In [7]:
sports1 = pd.Series([1,2,3,4],index=['cricket','football','basketball','golf'])
sports1

cricket       1
football      2
basketball    3
golf          4
dtype: int64

In [8]:
sports1['cricket']

1

In [10]:
sports2 = pd.Series([21,31,17,0],index=['cricket','football','basketball','golf'])
sports2['cricket']

21

In [18]:
sports1+sports2

cricket       22
football      33
basketball    20
golf           4
dtype: int64

In [31]:
df1 = pd.DataFrame(np.random.randn(8,5), index='P Q R S T U V W'.split(), columns='Score1 Score2 Score3 Score4 Score5'.split())
df1

     Score1    Score2    Score3    Score4    Score5
P -0.085651  1.208314  0.694746 -0.539738  1.198634
Q -0.156614 -0.131502  0.772861  0.252476  0.971696
R  1.696737 -0.001603  3.241844 -1.406310 -0.248295
S -1.145955  0.051111  1.425728 -0.023045  2.250460
T  0.586197 -1.152660 -2.113529  0.757053  0.092838
U  0.221625 -0.317106 -0.491224  0.194499 -0.696709
V -0.598247 -0.145080  1.297352 -0.190690  0.235346
W -0.023571 -0.752087 -0.505092  1.017182  0.090355

In [32]:
df1['Score2']

P    1.208314
Q   -0.131502
R   -0.001603
S    0.051111
T   -1.152660
U   -0.317106
V   -0.145080
W   -0.752087
Name: Score2, dtype: float64

In [33]:
df1[['Score3','Score1','Score4']]

     Score3    Score1    Score4
P  0.694746 -0.085651 -0.539738
Q  0.772861 -0.156614  0.252476
R  3.241844  1.696737 -1.406310
S  1.425728 -1.145955 -0.023045
T -2.113529  0.586197  0.757053
U -0.491224  0.221625  0.194499
V  1.297352 -0.598247 -0.190690
W -0.505092 -0.023571  1.017182

In [34]:
df1['Score6'] = df1['Score4']-df1['Score5']
print(df1['Score6'])
df1

P   -1.738372
Q   -0.719220
R   -1.158015
S   -2.273505
T    0.664215
U    0.891208
V   -0.426035
W    0.926827
Name: Score6, dtype: float64

     Score1    Score2    Score3    Score4    Score5    Score6
P -0.085651  1.208314  0.694746 -0.539738  1.198634 -1.738372
Q -0.156614 -0.131502  0.772861  0.252476  0.971696 -0.719220
R  1.696737 -0.001603  3.241844 -1.406310 -0.248295 -1.158015
S -1.145955  0.051111  1.425728 -0.023045  2.250460 -2.273505
T  0.586197 -1.152660 -2.113529  0.757053  0.092838  0.664215
U  0.221625 -0.317106 -0.491224  0.194499 -0.696709  0.891208
V -0.598247 -0.145080  1.297352 -0.190690  0.235346 -0.426035
W -0.023571 -0.752087 -0.505092  1.017182  0.090355  0.926827

In [35]:
df1.drop('Score2', axis=1)

     Score1    Score3    Score4    Score5    Score6
P -0.085651  0.694746 -0.539738  1.198634 -1.738372
Q -0.156614  0.772861  0.252476  0.971696 -0.719220
R  1.696737  3.241844 -1.406310 -0.248295 -1.158015
S -1.145955  1.425728 -0.023045  2.250460 -2.273505
T  0.586197 -2.113529  0.757053  0.092838  0.664215
U  0.221625 -0.491224  0.194499 -0.696709  0.891208
V -0.598247  1.297352 -0.190690  0.235346 -0.426035
W -0.023571 -0.505092  1.017182  0.090355  0.926827

In [38]:
print(df1.iloc[1:2])
df1.drop('Q')

     Score1    Score2    Score3    Score4    Score5   Score6
Q -0.156614 -0.131502  0.772861  0.252476  0.971696 -0.71922

     Score1    Score2    Score3    Score4    Score5    Score6
P -0.085651  1.208314  0.694746 -0.539738  1.198634 -1.738372
R  1.696737 -0.001603  3.241844 -1.406310 -0.248295 -1.158015
S -1.145955  0.051111  1.425728 -0.023045  2.250460 -2.273505
T  0.586197 -1.152660 -2.113529  0.757053  0.092838  0.664215
U  0.221625 -0.317106 -0.491224  0.194499 -0.696709  0.891208
V -0.598247 -0.145080  1.297352 -0.190690  0.235346 -0.426035
W -0.023571 -0.752087 -0.505092  1.017182  0.090355  0.926827

In [39]:
df2 = {
    'ID': [1001,1002,1003,1007,1076],
    'Name': ['John','Mercy','Akash','Kavin','Lally'],
    'Profit':[21,36,97,73,109]
}
df = pd.DataFrame(df2)
df

     ID   Name  Profit
0  1001   John      21
1  1002  Mercy      36
2  1003  Akash      97
3  1007  Kavin      73
4  1076  Lally     109

In [41]:
a = np.arange(1,43)
a

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42])

In [43]:
bc = a.reshape(7,6)
bc

array([[ 1,  2,  3,  4,  5,  6],
       [ 7,  8,  9, 10, 11, 12],
       [13, 14, 15, 16, 17, 18],
       [19, 20, 21, 22, 23, 24],
       [25, 26, 27, 28, 29, 30],
       [31, 32, 33, 34, 35, 36],
       [37, 38, 39, 40, 41, 42]])

In [44]:
bc[2][2]

15